# -*- coding: utf-8 -*-
#
# 存放统计的配置信息
# weideguo@dba 20210713
"""
mysql
### 磁盘 
降     <=15  
考虑降 <=30
考虑升 >=80
升     >=90



### cpu/内存 
降 
cpu / tps / qps  同时达到
max <= 50
avg <= 10


考虑降 
cpu / tps / qps  同时达到
max <= 80
avg <= 20


考虑升
cpu / tps / qps 任意一个达到
avg >= 40


升
cpu / tps / qps 任意一个达到
avg >= 80


异常
cpu / tps / qps / mem 任意一个达到
max >= 100


不满足以上情况时考虑降内存，但不能改变cpu
mem 达到
max <= 50
"""

mysql_disk_levels=[15,30,80,90]

#cpu 内存负载低 
#(avg max) (avg max) avg avg max
#  低        次低   次高 高 异常
mysql_cpu_levels = [(10,50),(20,80), 40, 80, 100]
mysql_tps_levels = [(10,50),(20,80), 40, 80, 100]
mysql_qps_levels = [(10,50),(20,80), 40, 80, 100]

#
#
mysql_mem_levels = [50,100]


"""
参考测试报告
https://cloud.tencent.com/document/product/236/8842

实例规格    存储空间    数据集    客户端数    单客户端并发数    QPS       TPS
1核1GB        200GB    19GB        1                     128    1757      97
1核2GB        200GB    38GB        1                     128    3016      167
2核4GB        200GB    76GB        1                     128    4082      816
4核8GB        200GB    142GB       1                     128    6551      1310
4核16GB       400GB    238GB       1                     128    11098     2219
8核32GB       700GB    238GB       2                     128    20484     3768
16核64GB      1TB      378GB       2                     128    36395     7279
16核96GB      1.5TB    378GB       3                     128    56464     11292
16核128GB     2TB      378GB       3                     128    81752     16350
24核244GB     3TB      567GB       4                     128    98528     19705
48核488GB     6TB      567GB       6                     128    142246    28449
48核488GB     6TB      140GB       6                     128    245509    46304
"""

performance_ref = {
"1C1000M"     :  (1757    ,  97     ),
"1C2000M"     :  (3016    ,  167    ),
"2C4000M"     :  (4082    ,  816    ),
"4C8000M"     :  (6551    ,  1310   ),
"4C16000M"    :  (11098   ,  2219   ),
"8C16000M"    :  (15000   ,  2900   ),      #没有参考 中间取平均
"8C32000M"    :  (20484   ,  3768   ),
"16C32000M"   :  (28000   ,  5500   ),      #没有参考
"16C64000M"   :  (36395   ,  7279   ),
"16C96000M"   :  (56464   ,  11292  ),
"16C128000M"  :  (81752   ,  16350  ),
"24C244000M"  :  (98528   ,  19705  ),
"48C488000M"  :  (142246  ,  28449  ),
"48C488000M"  :  (245509  ,  46304  ),
}
